app/controllers/password_infos_controller.rb

SELECT "password_infos".* FROM "password_infos"
---
  def index
    @password_infos = PasswordInfo.all

INSERT INTO "password_infos" ("website", "username", "password", "date_added", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["website", "test"], ["username", "adfdfdf"], ["password", "[FILTERED]"], ["date_added", "988"], ["created_at", "2022-07-01 00:08:26.240034"], ["updated_at", "2022-07-01 00:08:26.240034"]]
---
  def create
    @password_info = PasswordInfo.new(password_info_params)

    respond_to do |format|
      if @password_info.save

SELECT "password_infos".* FROM "password_infos" WHERE "password_infos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_password_info
      @password_info = PasswordInfo.find(params[:id])